from statsmodels.tsa.arima_model import ARIMA
from sklearn.linear_model import LogisticRegression
from PIL import Image
from sklearn.cluster import KMeans
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.linear_model import Lasso
from sklearn.feature_extraction.text import CountVectorizer
import pandas as pd
from sklearn.model_selection import GridSearchCV
from sklearn.preprocessing import PolynomialFeatures
from sklearn.decomposition import PCA
from sklearn.linear_model import ElasticNetCV
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.ensemble import GradientBoostingRegressor
from pathlib import Path
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import ElasticNet
from sklearn.model_selection import KFold
import gensim
from sklearn.preprocessing import MinMaxScaler
from sklearn.linear_model import LassoCV
# ^^^ pyforest auto-imports - don't write above this line
___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

<h1><p style="text-align: center;">Pandas Lesson, Session - 5</p><h1>

# Basic aggregation methods:

* ``count()``
* ``mean()``
* ``median()``
* ``min()``
* ``max()``
* ``std()``
* ``var()``
* ``sum()``
* ``idxmin()``
* ``idxmax()``
* ``corr()``

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np
np.random.seed(42)

In [2]:
df = pd.DataFrame(np.random.randint(0, 100, size=(7, 5)), columns=["x1", "x2", "x3", "x4", "x5"])
df

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74
2  87  99  23   2  21
3  52   1  87  29  37
4   1  63  59  20  32
5  75  57  21  88  48
6  90  58  41  91  59

In [3]:
df.count()

x1    7
x2    7
x3    7
x4    7
x5    7
dtype: int64

In [4]:
df['x1'].count()

7

In [5]:
df.x1.count()

7

In [6]:
df.mean()

x1    53.714286
x2    64.571429
x3    47.285714
x4    53.571429
x5    47.285714
dtype: float64

In [7]:
df.x2.mean()

64.57142857142857

In [8]:
df.median()

x1    52.0
x2    63.0
x3    41.0
x4    71.0
x5    48.0
dtype: float64

In [9]:
df.x3.median()

41.0

In [10]:
df.min()

x1     1
x2     1
x3    14
x4     2
x5    21
dtype: int32

In [11]:
df.x4.min()

2

In [12]:
df.x4.argmin()

2

In [13]:
df.argmin()

AttributeError: 'DataFrame' object has no attribute 'argmin'

Pandas dataframe.idxmin() function returns index of first occurrence of minimum over requested axis. While finding the index of the minimum value across any index, all NA/null values are excluded.

In [ ]:
df

   x1  x2  x3  x4  x5
0  79  14  61  61  46
1  61  50  54  63   2
2  50   6  20  72  38
3  17   3  88  59  13
4   8  89  52   1  83
5  91  59  70  43   7
6  46  34  77  80  35

In [ ]:
df.min()

x1     8
x2     3
x3    20
x4     1
x5     2
dtype: int32

In [ ]:
df.idxmin()

x1    4
x2    3
x3    0
x4    2
x5    2
dtype: int64

In [ ]:
df['x5'].idxmin()

2

In [ ]:
df.std()

x1    33.673502
x2    32.623392
x3    30.663302
x4    35.818325
x5    18.454577
dtype: float64

In [ ]:
df[["x1", "x2"]].std()

x1    33.673502
x2    32.623392
dtype: float64

In [ ]:
df.var()

x1    1133.904762
x2    1064.285714
x3     940.238095
x4    1282.952381
x5     340.571429
dtype: float64

In [ ]:
df[["x1", "x2"]].var()

x1    1133.904762
x2    1064.285714
dtype: float64

In [ ]:
df

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74
2  87  99  23   2  21
3  52   1  87  29  37
4   1  63  59  20  32
5  75  57  21  88  48
6  90  58  41  91  59

In [ ]:
df.sum(axis=0)

x1    376
x2    452
x3    331
x4    375
x5    331
dtype: int64

In [ ]:
df.sum(axis=1)

0    288
1    336
2    232
3    206
4    175
5    289
6    339
dtype: int64

In [ ]:
df.x1.sum()

376

In [ ]:
df.corr()

          x1        x2        x3        x4        x5
x1  1.000000  0.041895 -0.564373  0.200385 -0.146551
x2  0.041895  1.000000 -0.562665  0.023779  0.139760
x3 -0.564373 -0.562665  1.000000 -0.158751  0.167712
x4  0.200385  0.023779 -0.158751  1.000000  0.845133
x5 -0.146551  0.139760  0.167712  0.845133  1.000000

In [ ]:
df[["x1", "x2"]].corr()

          x1        x2
x1  1.000000  0.041895
x2  0.041895  1.000000

In [ ]:
df['x1'].corr(df['x2'])

0.04189528582574876

In [ ]:
# include = 'object'

df.describe()

              x1         x2         x3         x4         x5
count   7.000000   7.000000   7.000000   7.000000   7.000000
mean   53.714286  64.571429  47.285714  53.571429  47.285714
std    33.673502  32.623392  30.663302  35.818325  18.454577
min     1.000000   1.000000  14.000000   2.000000  21.000000
25%    35.500000  57.500000  22.000000  24.500000  34.500000
50%    52.000000  63.000000  41.000000  71.000000  48.000000
75%    81.000000  87.000000  72.500000  81.000000  59.500000
max    90.000000  99.000000  87.000000  91.000000  74.000000

In [ ]:
# df.describe().transpose()

df.describe().T

    count       mean        std   min   25%   50%   75%   max
x1    7.0  53.714286  33.673502   1.0  35.5  52.0  81.0  90.0
x2    7.0  64.571429  32.623392   1.0  57.5  63.0  87.0  99.0
x3    7.0  47.285714  30.663302  14.0  22.0  41.0  72.5  87.0
x4    7.0  53.571429  35.818325   2.0  24.5  71.0  81.0  91.0
x5    7.0  47.285714  18.454577  21.0  34.5  48.0  59.5  74.0

# Groupby  & Aggregation

## DataFrame.groupby()

The ``groupby`` method allows you to group rows of data together and call aggregate functions

In [ ]:
df = sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [ ]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [ ]:
df.describe().T

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [ ]:
df.describe(include='object')

           species
count          150
unique           3
top     versicolor
freq            50

In [ ]:
df.describe(include ="all").T # "number" and "object" can be used as include/exclude parameter

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
sepal_length,150,NaN,NaN,NaN,5.84333,0.828066,4.3,5.1,5.8,6.4,7.9
sepal_width,150,NaN,NaN,NaN,3.05733,0.435866,2,2.8,3,3.3,4.4
petal_length,150,NaN,NaN,NaN,3.758,1.7653,1,1.6,4.35,5.1,6.9
petal_width,150,NaN,NaN,NaN,1.19933,0.762238,0.1,0.3,1.3,1.8,2.5
species,150,3,versicolor,50,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df[["sepal_length"]].describe()

       sepal_length
count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000

In [ ]:
df.describe()[["sepal_length"]]

       sepal_length
count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000

In [ ]:
df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [ ]:
df.corr()[["sepal_length"]]

              sepal_length
sepal_length      1.000000
sepal_width      -0.117570
petal_length      0.871754
petal_width       0.817941

In [ ]:
df['petal_length'].corr(df["petal_width"])

0.962865431402796

In [ ]:
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [ ]:
df['species'].nunique()

3

In [ ]:
df['species'].value_counts()

versicolor    50
setosa        50
virginica     50
Name: species, dtype: int64

In [ ]:
df['species'].value_counts(dropna = False, normalize = True)

versicolor    0.333333
setosa        0.333333
virginica     0.333333
Name: species, dtype: float64

In [ ]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
df.groupby('species')

In [ ]:
df.groupby("species").mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [ ]:
df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [ ]:
df.groupby("species").describe()

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

In [ ]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
df.groupby('species')['sepal_length'].sum()

species
setosa        250.3
versicolor    296.8
virginica     329.4
Name: sepal_length, dtype: float64

In [ ]:
df.groupby('species').sum()['sepal_length']

species
setosa        250.3
versicolor    296.8
virginica     329.4
Name: sepal_length, dtype: float64

In [ ]:
df.groupby('species')[['sepal_length']].sum()

            sepal_length
species
setosa             250.3
versicolor         296.8
virginica          329.4

In [ ]:
df.groupby('species')[['sepal_length', "sepal_width"]].sum()

            sepal_length  sepal_width
species
setosa             250.3        171.4
versicolor         296.8        138.5
virginica          329.4        148.7

In [ ]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

In [ ]:
df1 = pd.DataFrame(data)
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

**Now you can use the ``.groupby()`` method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

You can save this object as a new variable:

In [ ]:
df1.groupby('Company').median()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [ ]:
df1.groupby('Company')

In [ ]:
by_comp = df1.groupby('Company')

And then call aggregate methods off the object:

In [ ]:
by_comp.median()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [ ]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [ ]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [ ]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [ ]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [ ]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [ ]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [ ]:
by_comp.describe().T

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [ ]:
df1.groupby(['Company', "Person"]).describe()

                Sales
                count   mean std    min    25%    50%    75%    max
Company Person
FB      Carl      1.0  243.0 NaN  243.0  243.0  243.0  243.0  243.0
        Sarah     1.0  350.0 NaN  350.0  350.0  350.0  350.0  350.0
GOOG    Charlie   1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
        Sam       1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
MSFT    Amy       1.0  340.0 NaN  340.0  340.0  340.0  340.0  340.0
        Vanessa   1.0  124.0 NaN  124.0  124.0  124.0  124.0  124.0

# DataFrame/Series Operations

- ### `.aggregate()`
- ### `.filter()`
- ### `.transform()`
- ### `.apply()`
- ### `.applymap()`
- ### `.map()`
- ### `.pivot() & .pivot_table()`
- ### `.stack() & .unstack()`

In [ ]:
df2 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10, 23, 33, 22, 11, 99, 76, 84, 45],
                   'var2': [100, 253, 333, 262, 111, 969, 405, 578, 760]})
df2

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

## ``.aggregate()``

In [ ]:
df2.groupby('groups').aggregate([np.min, np.median, np.max])

       var1             var2
       amin median amax amin median amax
groups
A        10     22   76  100    262  405
B        11     23   84  111    253  578
C        33     45   99  333    760  969

In [ ]:
df2.groupby('groups').agg([np.min, "median", max])

       var1            var2
       amin median max amin median  max
groups
A        10     22  76  100    262  405
B        11     23  84  111    253  578
C        33     45  99  333    760  969

In [ ]:
df2.groupby('groups').agg({'var1':(min, 'max'), 'var2':'median'})

       var1       var2
        min max median
groups
A        10  76    262
B        11  84    253
C        33  99    760

## ``.filter()``

Pandas dataframe.filter() function is used to Subset rows or columns of dataframe according to labels in the specified index.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.filter.html

https://www.sharpsightlabs.com/blog/pandas-filter/

In [ ]:
df2

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [ ]:
df2['groups'].unique()

array(['A', 'B', 'C'], dtype=object)

In [ ]:
df2.groupby("groups").mean()

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [ ]:
def filter_func(x):
    return x["var1"].mean() > 39

In [ ]:
# returns the rows that meet the condition, as a DataFrame

df2.groupby('groups').filter(filter_func)

  groups  var1  var2
1      B    23   253
2      C    33   333
4      B    11   111
5      C    99   969
7      B    84   578
8      C    45   760

In [ ]:
df2.groupby("groups").sum()

        var1  var2
groups
A        108   767
B        118   942
C        177  2062

In [ ]:
df2.groupby('groups').filter(lambda x : x['var2'].sum() < 800)

  groups  var1  var2
0      A    10   100
3      A    22   262
6      A    76   405

In [ ]:
df2.filter(["groups", "var1"])

  groups  var1
0      A    10
1      B    23
2      C    33
3      A    22
4      B    11
5      C    99
6      A    76
7      B    84
8      C    45

In [ ]:
df2.filter(regex ='1$')

   var1
0    10
1    23
2    33
3    22
4    11
5    99
6    76
7    84
8    45

In [ ]:
df2.filter(regex ='[v]')

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

In [ ]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [ ]:
# The ‘like‘ parameter enables you to identify items that contain a certain string.

df1.filter(like='1', axis=0)

  Company   Person  Sales
1    GOOG  Charlie    120

In [ ]:
df1.filter(like='C', axis=1)

  Company
0    GOOG
1    GOOG
2    MSFT
3    MSFT
4      FB
5      FB

## ``.transform()``

Python’s Transform function returns a self-produced dataframe with transformed values after applying the function specified in its parameter. This dataframe has the same length as the passed dataframe.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.transform.html

https://www.analyticsvidhya.com/blog/2020/03/understanding-transform-function-python/

In [ ]:
df2

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [ ]:
df_a = df2.iloc[:, 1:3]

In [ ]:
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

In [ ]:
# returns A DataFrame that must have the same length as self. Standardization(mean 0 std 1) Normalization (0-1)
# z-score is is z = (x-μ)/σ, where x is the raw score, μ is the population mean, and σ is the population standard deviation.

df_a.transform(lambda x : (x-x.mean()) / x.std())

# This is the dataframe we get after applying Transform function:

       var1      var2
0 -1.040605 -1.078044
1 -0.651625 -0.560989
2 -0.352409 -0.290633
3 -0.681547 -0.530573
4 -1.010684 -1.040870
5  1.622413  1.858697
6  0.934218 -0.047312
7  1.173590  0.537332
8  0.006649  1.152392

In [ ]:
# df_a.var1.transform(lambda x : (x-x.mean()) / x.std())

df_a['var1'].transform(lambda x : (x-x.mean()) / x.std())

0   -1.040605
1   -0.651625
2   -0.352409
3   -0.681547
4   -1.010684
5    1.622413
6    0.934218
7    1.173590
8    0.006649
Name: var1, dtype: float64

In [ ]:
df_a.transform([np.sqrt, np.exp])

       var1                     var2
       sqrt           exp       sqrt            exp
0  3.162278  2.202647e+04  10.000000   2.688117e+43
1  4.795832  9.744803e+09  15.905974  7.524955e+109
2  5.744563  2.146436e+14  18.248288  4.169294e+144
3  4.690416  3.584913e+09  16.186414  6.097534e+113
4  3.316625  5.987414e+04  10.535654   1.609487e+48
5  9.949874  9.889030e+42  31.128765            inf
6  8.717798  1.014800e+33  20.124612  7.749348e+175
7  9.165151  3.025077e+36  24.041631  1.052472e+251
8  6.708204  3.493427e+19  27.568098            inf

In [ ]:
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

Transform comes in handy during feature extraction. As the name suggests, we extract new features from existing ones.

In [ ]:
df2

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [ ]:
group_mean =df_a.mean().rename("Group_mean").reset_index()
group_mean

  index  Group_mean
0  var1   44.777778
1  var2  419.000000

In [ ]:
df2.groupby('groups')["var1"].mean()

groups
A    36.000000
B    39.333333
C    59.000000
Name: var1, dtype: float64

In [ ]:
df2["Group_mean"] = df2.groupby('groups')["var1"].transform('mean')
df2

  groups  var1  var2  Group_mean
0      A    10   100   36.000000
1      B    23   253   39.333333
2      C    33   333   59.000000
3      A    22   262   36.000000
4      B    11   111   39.333333
5      C    99   969   59.000000
6      A    76   405   36.000000
7      B    84   578   39.333333
8      C    45   760   59.000000

## ``.apply()``

Pandas.apply allow the users to pass a function and apply it on every single value of the Pandas series.

A DataFrame or a Series object, with the changes.

This function does NOT make changes to the original DataFrame object.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html

**apply()** is used to apply a function along an axis of the DataFrame or on values of Series. **applymap()** is used to apply a function to a DataFrame elementwise. **map()** is used to substitute each value in a Series with another value.

https://towardsdatascience.com/introduction-to-pandas-apply-applymap-and-map-5d3e044e93ff#:~:text=apply()%20is%20used%20to,a%20Series%20with%20another%20value.

https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas

### DataFrame.apply()

In [ ]:
df2

  groups  var1  var2  Group_mean
0      A    10   100   36.000000
1      B    23   253   39.333333
2      C    33   333   59.000000
3      A    22   262   36.000000
4      B    11   111   39.333333
5      C    99   969   59.000000
6      A    76   405   36.000000
7      B    84   578   39.333333
8      C    45   760   59.000000

In [ ]:
df2.drop("Group_mean", axis=1, inplace=True)
df2

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [ ]:
df2.apply(np.sum)

groups    ABCABCABC
var1            403
var2           3771
dtype: object

In [ ]:
df2['var1'].sum()

403

In [ ]:
# sum() functions works with putting + sign between each element of an iterable object

df2['groups'].sum()

'ABCABCABC'

In [ ]:
# It gives an error due to the non-numeric column : "groups"

# df4.apply(np.median)

In [ ]:
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

In [ ]:
df_a.apply(np.median)

var1     33.0
var2    333.0
dtype: float64

In [ ]:
df_a.apply(np.mean, axis=1)

0     55.0
1    138.0
2    183.0
3    142.0
4     61.0
5    534.0
6    240.5
7    331.0
8    402.5
dtype: float64

In [ ]:
# apply() can produce aggregated results

df_a.apply(lambda x: x.sum())

var1     403
var2    3771
dtype: int64

In [ ]:
# ValueError: transforms cannot produce aggregated results

df_a.transform(lambda x: x.sum())

ValueError: transforms cannot produce aggregated results

In [ ]:
df2.groupby('groups').apply(np.mean)

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [ ]:
df2.groupby("groups").mean()

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

### Series.apply() - df["col"].apply()

In [ ]:
df3 = pd.DataFrame({'col1':[1, 2, 3, 4], 'col2':[444, 555, 666, 444], 'col3':['abc', 'def', 'ghi', 'xyz']})

df3

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
def squared(x):
    return x**2

In [ ]:
df3['col1'].apply(squared)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [ ]:
df3['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

### DataFrame.applymap()

applymap() is only available in DataFrame and used for element-wise operation across the whole DataFrame. It has been optimized and some cases work **much faster than apply()**

applymap() method only works on a pandas dataframe where function is applied on every element individually. apply() method can be applied both to series and dataframes where function can be applied both series and individual elements based on the type of function provided.

https://www.geeksforgeeks.org/difference-between-map-applymap-and-apply-methods-in-pandas/

In [ ]:
df4 = df3.iloc[:, :2]
df4

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [ ]:
df4.applymap(lambda x: x*5)

   col1  col2
0     5  2220
1    10  2775
2    15  3330
3    20  2220

In [ ]:
df4

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

## .map()

Python's map() is a built-in function that allows you to process and transform all the items in an iterable without using an explicit for loop, a technique commonly known as mapping. map() is useful when you need to apply a transformation function to each item in an iterable and transform them into a new iterable.

https://realpython.com/python-map-function/#:~:text=Python's%20map()%20is%20a,them%20into%20a%20new%20iterable.

The map() function is used to map values of Series according to input correspondence. Used for substituting each value in a Series with another value, that may be derived from a function, a dict or a Series.

map() accepts a dict or a Series. Values that are not found in the dict are converted to NaN, unless
the dict has a default value.

https://www.w3resource.com/pandas/series/series-map.php

### Series.map() - df["col"].map()

In [ ]:
df4['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [ ]:
df4['col1'].map({1:"A", 2:"B"})

0      A
1      B
2    NaN
3    NaN
Name: col1, dtype: object

In [ ]:
s = pd.Series(['fox', 'cow', np.nan, 'dog'])
s

0    fox
1    cow
2    NaN
3    dog
dtype: object

In [ ]:
# https://realpython.com/python-f-strings/

s.map('I am a {}'.format)

0    I am a fox
1    I am a cow
2    I am a nan
3    I am a dog
dtype: object

In [ ]:
s.map('I am a {}'.format, na_action='ignore')

0    I am a fox
1    I am a cow
2           NaN
3    I am a dog
dtype: object

## `df.transform() vs df.apply()`

Both apply() and transform() can be used to manipulate the entire DataFrame.

Both apply() and transform() support lambda expression.

Both apply() and transform() can be used for manipulating a single column.

**What are the differences?**

Here are the three main differences

(1) transform() works with function, a string function, a list of functions, and a dict. However, apply() is only allowed with function.

(2) transform() cannot produce aggregated results.

(3) apply() works with multiple Series at a time. But, transform() is only allowed to work with a single Series at a time.

**transform()** can take a function, a string function, a list of functions, and a dict. However, **apply()** is only allowed a function. apply() works with multiple Series at a time. But, transform() is only allowed to work with a single Series at a time.

https://towardsdatascience.com/difference-between-apply-and-transform-in-pandas-242e5cf32705#:~:text=transform()%20can%20take%20a,is%20only%20allowed%20a%20function.&text=produce%20aggregated%20results-,apply()%20works%20with%20multiple%20Series%20at%20a%20time.,single%20Series%20at%20a%20time.

In [ ]:
df5 = pd.DataFrame({'A': [1,2,3], 'B': [10, 20, 30]})
df5

   A   B
0  1  10
1  2  20
2  3  30

In [ ]:
df5.apply(lambda x: x+10)

    A   B
0  11  20
1  12  30
2  13  40

In [ ]:
df5.transform(lambda x: x+10)

    A   B
0  11  20
1  12  30
2  13  40

In [ ]:
df5['B_ap'] = df5['B'].apply(lambda x: x+10)
df5['B_tr'] = df5['B'].transform(lambda x: x+10)
df5

   A   B  B_ap  B_tr
0  1  10    20    20
1  2  20    30    30
2  3  30    40    40

### Differences between .apply() and .transform() when manupulating data
(1) transform() works with function, a string function, a list of functions, and a dict. However, apply() is only allowed with function.

(2) transform() cannot produce aggregated results.

(3) apply() works with multiple Series at a time. But, transform() is only allowed to work with a single Series at a time.

In [ ]:
df5 = df5[["A", "B"]]
df5

   A   B
0  1  10
1  2  20
2  3  30

In [ ]:
# (1) transform() works with function, a string function, a list of functions, and a dict. 
# However, apply() is only allowed with function.

df5.transform('sqrt')

#df5.apply('sqrt') gives an error

          A         B
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226

In [ ]:
df5.apply(np.sqrt)

          A         B
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226

In [ ]:
df5.transform([np.sqrt, np.exp])

#df5.apply([np.sqrt, np.exp])

          A                    B
       sqrt        exp      sqrt           exp
0  1.000000   2.718282  3.162278  2.202647e+04
1  1.414214   7.389056  4.472136  4.851652e+08
2  1.732051  20.085537  5.477226  1.068647e+13

In [ ]:
df5.transform({'A': np.sqrt, 'B': np.exp})

#df5.apply({'A': np.sqrt, 'B': np.exp})

          A             B
0  1.000000  2.202647e+04
1  1.414214  4.851652e+08
2  1.732051  1.068647e+13

In [ ]:
# (2) transform() cannot produce aggregated results.

df5.apply(lambda x: x.sum())

# df5.transform(lambda x:x.sum()) gives an error

A     6
B    60
dtype: int64

In [ ]:
# (3) apply() works with multiple Series at a time. But, transform() is only allowed to work with a single Series at a time.

df5.apply(lambda x: x["B"]-x["A"], axis=1)

# df5.transform(lambda x: x["B"]-x["A"], axis=1) gives an error of "ValueError: transforms cannot produce aggregated results"

0     9
1    18
2    27
dtype: int64

### Differences Between .apply() and .transform() when using them in conjunction with groupby()
(1) transform() returns a DataFrame that has the same length as the input

(2) apply() works with multiple Series at a time. But, transform() is only allowed to work with a single Series at a time.

In [ ]:
df6 = pd.DataFrame({'key': ['a','b','c'] * 3,
                    'A': np.arange(9),
                    'B': [1,2,3] * 3})
df6

  key  A  B
0   a  0  1
1   b  1  2
2   c  2  3
3   a  3  1
4   b  4  2
5   c  5  3
6   a  6  1
7   b  7  2
8   c  8  3

In [ ]:
df6.groupby('key')['A'].sum()

key
a     9
b    12
c    15
Name: A, dtype: int32

In [ ]:
df6.groupby('key')['A'].apply(lambda x: x.sum())

key
a     9
b    12
c    15
Name: A, dtype: int64

In [ ]:
df6.groupby('key')['A'].transform(lambda x: x.sum())

0     9
1    12
2    15
3     9
4    12
5    15
6     9
7    12
8    15
Name: A, dtype: int32

In [ ]:
df6.groupby('key').apply(lambda x: x["B"]-x["A"])

# df6.groupby('key').transform(lambda x: x["B"]-x["A"]) gives an error

key
a    0    1
     3   -2
     6   -5
b    1    1
     4   -2
     7   -5
c    2    1
     5   -2
     8   -5
dtype: int64

# pivot() vs pivot_table()

- Pivot_table is a generalization of pivot that can handle duplicate values for one pivoted index/column pair.

- Pivot_table will only allow numeric types as "values=", whereas pivot will take string types as "values=".

- Pivot_table also supports using multiple columns for the index.

In [ ]:
data = {'gender':['male', 'female', 'female', 'male', 'female', 'male'],
       'sport':['tennis', 'tennis', 'basketball', 'football', 'voleyball', 'basketball'],
       'age':[20, 24, 26, 23, 22, 21],
       'height':[185, 172, 175, 178, 182, 196],
       'weight':[83, 58, 62, 80, 65, 90]}

df7 = pd.DataFrame(data)

df7

   gender       sport  age  height  weight
0    male      tennis   20     185      83
1  female      tennis   24     172      58
2  female  basketball   26     175      62
3    male    football   23     178      80
4  female   voleyball   22     182      65
5    male  basketball   21     196      90

In [ ]:
df7.groupby(["gender","sport"]).mean()

                   age  height  weight
gender sport
female basketball   26     175      62
       tennis       24     172      58
       voleyball    22     182      65
male   basketball   21     196      90
       football     23     178      80
       tennis       20     185      83

In [ ]:
df7.pivot_table(index='gender',
                columns='sport',
                values=['age','height','weight'],
                aggfunc='mean')

              age                               height                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female       26.0      NaN   24.0      22.0      175.0      NaN  172.0
male         21.0     23.0   20.0       NaN      196.0    178.0  185.0

                     weight
sport  voleyball basketball football tennis voleyball
gender
female     182.0       62.0      NaN   58.0      65.0
male         NaN       90.0     80.0   83.0       NaN

In [ ]:
df7.pivot(index='gender',
          columns='sport',
          values=['age','height','weight'])

              age                               height                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female       26.0      NaN   24.0      22.0      175.0      NaN  172.0
male         21.0     23.0   20.0       NaN      196.0    178.0  185.0

                     weight
sport  voleyball basketball football tennis voleyball
gender
female     182.0       62.0      NaN   58.0      65.0
male         NaN       90.0     80.0   83.0       NaN

In [ ]:
df7

   gender       sport  age  height  weight
0    male      tennis   20     185      83
1  female      tennis   24     172      58
2  female  basketball   26     175      62
3    male    football   23     178      80
4  female   voleyball   22     182      65
5    male  basketball   21     196      90

In [ ]:
df7.loc[2, "sport"] = "tennis"
df7

   gender       sport  age  height  weight
0    male      tennis   20     185      83
1  female      tennis   24     172      58
2  female      tennis   26     175      62
3    male    football   23     178      80
4  female   voleyball   22     182      65
5    male  basketball   21     196      90

In [ ]:
df7.pivot_table(index='gender',
                columns='sport',
                values=['age','height','weight'],
                aggfunc='mean')

              age                               height                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female        NaN      NaN   25.0      22.0        NaN      NaN  173.5
male         21.0     23.0   20.0       NaN      196.0    178.0  185.0

                     weight
sport  voleyball basketball football tennis voleyball
gender
female     182.0        NaN      NaN   60.0      65.0
male         NaN       90.0     80.0   83.0       NaN

In [ ]:
df7.pivot(index='gender',
          columns='sport',
          values=['age','height','weight'])

ValueError: Index contains duplicate entries, cannot reshape

What is the basic difference between pivot() and pivot_table( )?
 
**pivot()** is used for pivoting the dataframe **without** applying aggregation. It doesn't contain same values or columns/index.

While

**pivot_table()** will pivot the dataframe by applying aggregation on it. And it will **work with duplicate values** or columns/index.

pivot() is used for pivoting without aggregation. Therefore, it can’t deal with duplicate values for one index/column pair.

On the other hand, pivot_table() will work because it will handle duplicate values by aggregating them.

https://www.quora.com/In-pandas-whats-the-difference-between-dataframe-pivot-and-dataframe-pivot_table

In [ ]:
#gives an error

#df7.pivot(index='gender',
#          columns='sport',
#          values=['age','height','weight'])

In [ ]:
df7.pivot(columns='sport',
          values=['age','height','weight'])

             age                               height                  \
sport basketball football tennis voleyball basketball football tennis
0            NaN      NaN   20.0       NaN        NaN      NaN  185.0
1            NaN      NaN   24.0       NaN        NaN      NaN  172.0
2            NaN      NaN   26.0       NaN        NaN      NaN  175.0
3            NaN     23.0    NaN       NaN        NaN    178.0    NaN
4            NaN      NaN    NaN      22.0        NaN      NaN    NaN
5           21.0      NaN    NaN       NaN      196.0      NaN    NaN

                    weight
sport voleyball basketball football tennis voleyball
0           NaN        NaN      NaN   83.0       NaN
1           NaN        NaN      NaN   58.0       NaN
2           NaN        NaN      NaN   62.0       NaN
3           NaN        NaN     80.0    NaN       NaN
4         182.0        NaN      NaN    NaN      65.0
5           NaN       90.0      NaN    NaN       NaN

In [ ]:
df7.pivot_table(index=['gender', 'sport'],
                values=['age','height','weight'],
                aggfunc='mean')

                   age  height  weight
gender sport
female tennis       25   173.5      60
       voleyball    22   182.0      65
male   basketball   21   196.0      90
       football     23   178.0      80
       tennis       20   185.0      83

In [ ]:
df7["status"] = ["professional", "professional", "professional", "amateur", "amateur", "amateur"]
df7

   gender       sport  age  height  weight        status
0    male      tennis   20     185      83  professional
1  female      tennis   24     172      58  professional
2  female      tennis   26     175      62  professional
3    male    football   23     178      80       amateur
4  female   voleyball   22     182      65       amateur
5    male  basketball   21     196      90       amateur

In [ ]:
df7.pivot_table(index=['gender', 'sport'],
                columns="status",
                values=['age', 'height', 'weight'],
                aggfunc='mean')

                      age               height               weight  \
status            amateur professional amateur professional amateur
gender sport
female tennis         NaN         25.0     NaN        173.5     NaN
       voleyball     22.0          NaN   182.0          NaN    65.0
male   basketball    21.0          NaN   196.0          NaN    90.0
       football      23.0          NaN   178.0          NaN    80.0
       tennis         NaN         20.0     NaN        185.0     NaN


status            professional
gender sport
female tennis             60.0
       voleyball           NaN
male   basketball          NaN
       football            NaN
       tennis             83.0

# .stack() & .unstack()

Reshape using Stack() and unstack() function in Pandas python: Reshaping the data using stack() function in pandas converts the data into stacked format .i.e. the column is stacked row wise. When more than one column header is present we can stack the specific column header by specified the level. unstack() function in pandas converts the data into unstacked format.

https://www.datasciencemadesimple.com/reshape-using-stack-unstack-function-pandas-python/

**why and when should use a stack() and unstack() methods?**

https://stackoverflow.com/questions/69139030/why-and-when-should-use-a-stack-and-unstack-methods

In [ ]:
df8 = df7.pivot_table(index=['gender', 'sport'],
                columns="status",
                values=['age','height','weight'],
                aggfunc='mean')
df8

                      age               height               weight  \
status            amateur professional amateur professional amateur
gender sport
female tennis         NaN         25.0     NaN        173.5     NaN
       voleyball     22.0          NaN   182.0          NaN    65.0
male   basketball    21.0          NaN   196.0          NaN    90.0
       football      23.0          NaN   178.0          NaN    80.0
       tennis         NaN         20.0     NaN        185.0     NaN


status            professional
gender sport
female tennis             60.0
       voleyball           NaN
male   basketball          NaN
       football            NaN
       tennis             83.0

In [ ]:
df8.stack(level=-1, dropna=False)

                                 age  height  weight
gender sport      status
female tennis     amateur        NaN     NaN     NaN
                  professional  25.0   173.5    60.0
       voleyball  amateur       22.0   182.0    65.0
                  professional   NaN     NaN     NaN
male   basketball amateur       21.0   196.0    90.0
                  professional   NaN     NaN     NaN
       football   amateur       23.0   178.0    80.0
                  professional   NaN     NaN     NaN
       tennis     amateur        NaN     NaN     NaN
                  professional  20.0   185.0    83.0

In [ ]:
df8.stack(level=-2, dropna=False)

status                    amateur  professional
gender sport
female tennis     age         NaN          25.0
                  height      NaN         173.5
                  weight      NaN          60.0
       voleyball  age        22.0           NaN
                  height    182.0           NaN
                  weight     65.0           NaN
male   basketball age        21.0           NaN
                  height    196.0           NaN
                  weight     90.0           NaN
       football   age        23.0           NaN
                  height    178.0           NaN
                  weight     80.0           NaN
       tennis     age         NaN          20.0
                  height      NaN         185.0
                  weight      NaN          83.0

In [ ]:
df8

                      age               height               weight  \
status            amateur professional amateur professional amateur
gender sport
female tennis         NaN         25.0     NaN        173.5     NaN
       voleyball     22.0          NaN   182.0          NaN    65.0
male   basketball    21.0          NaN   196.0          NaN    90.0
       football      23.0          NaN   178.0          NaN    80.0
       tennis         NaN         20.0     NaN        185.0     NaN


status            professional
gender sport
female tennis             60.0
       voleyball           NaN
male   basketball          NaN
       football            NaN
       tennis             83.0

unstack() function pivots a level of the (necessarily hierarchical) index labels, **returning a DataFrame having a new level of column labels** whose inner-most level consists of the pivoted index labels.

https://www.w3resource.com/pandas/dataframe/dataframe-unstack.php

In [ ]:
df8

                      age               height               weight  \
status            amateur professional amateur professional amateur
gender sport
female tennis         NaN         25.0     NaN        173.5     NaN
       voleyball     22.0          NaN   182.0          NaN    65.0
male   basketball    21.0          NaN   196.0          NaN    90.0
       football      23.0          NaN   178.0          NaN    80.0
       tennis         NaN         20.0     NaN        185.0     NaN


status            professional
gender sport
female tennis             60.0
       voleyball           NaN
male   basketball          NaN
       football            NaN
       tennis             83.0

In [ ]:
df8.unstack(level=0)

               age                           height                      \
status     amateur       professional       amateur        professional
gender      female  male       female  male  female   male       female
sport
basketball     NaN  21.0          NaN   NaN     NaN  196.0          NaN
football       NaN  23.0          NaN   NaN     NaN  178.0          NaN
tennis         NaN   NaN         25.0  20.0     NaN    NaN        173.5
voleyball     22.0   NaN          NaN   NaN   182.0    NaN          NaN

                   weight
status            amateur       professional
gender       male  female  male       female  male
sport
basketball    NaN     NaN  90.0          NaN   NaN
football      NaN     NaN  80.0          NaN   NaN
tennis      185.0     NaN   NaN         60.0  83.0
voleyball     NaN    65.0   NaN          NaN   NaN

In [ ]:
df8.unstack(level=-1)

              age                                                         \
status    amateur                           professional
sport  basketball football tennis voleyball   basketball football tennis
gender
female        NaN      NaN    NaN      22.0          NaN      NaN   25.0
male         21.0     23.0    NaN       NaN          NaN      NaN   20.0

                     height           ...                            weight  \
status              amateur           ... professional              amateur
sport  voleyball basketball football  ...       tennis voleyball basketball
gender                                ...
female       NaN        NaN      NaN  ...        173.5       NaN        NaN
male         NaN      196.0    178.0  ...        185.0       NaN       90.0


status                           professional
sport  football tennis voleyball   basketball football tennis voleyball
gender
female      NaN    NaN      65.0          NaN      NaN   60.0       NaN
male       80.0    NaN       NaN          NaN      NaN   83.0       NaN

[2 rows x 24 columns]

In [ ]:
df8.unstack(level=0, fill_value="-")

               age                         height                         \
status     amateur      professional      amateur      professional
gender      female male       female male  female male       female male
sport
basketball       -   21            -  NaN       -  196            -  NaN
football         -   23            -  NaN       -  178            -  NaN
tennis         NaN  NaN           25   20     NaN  NaN        173.5  185
voleyball       22    -          NaN    -     182    -          NaN    -

            weight
status     amateur      professional
gender      female male       female male
sport
basketball       -   90            -  NaN
football         -   80            -  NaN
tennis         NaN  NaN           60   83
voleyball       65    -          NaN    -

# The End of the Session - 5